Tekla Open API Reference for Tekla Structures 2025
LinkFrameAttributes Methods
The LinkFrameAttributes type exposes the following members.
Methods
Name | Description
GetAxisAlignedBoundingBox
 Gets the bounding box of the frame in the global axis coordinate system.
GetObjectAlignedBoundingBox
 Gets the bounding box of the frame in the local coordinate system.
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
LinkFrameAttributes Class
Tekla.Structures.Drawing Namespace